[
{"predicted_answer":"If your child is born on or after 1 January 2015, you will receive the cash gifts in your selected bank account, in 5 payments within 18 months from the birth of the child.Payment Schedule for children born on or after 1 Jan 2015Birth Order 1st & 2ndBirth Order 3rd onwardsWithin 10 working days of birth¹$3,000$4,0006 months old$1,500$2,00012 months old$1,500$2,000      15 months old$1000$100018 Months old$1000$1000Total Payment$8,000$10,000¹ from birth registration or joining Baby Bonus (whichever is later)To check the scheduled payment date and cash gift payment date, you can select 'View Account Summary' under Services on Baby Bonus Online. For children who were born before 1 January 2015 and have enrolled for the scheme, you can also check their payment details using 'View Account Summary' under Services."},
{"predicted_answer":"Parents can use the funds in the Child Development Account (CDA) for the other siblings of the child. "},
{"predicted_answer":"To join the Baby Bonus Scheme, please start by checking your child’s eligibility on Baby Bonus Online. If your child qualifies, you may proceed to apply by following these steps. STEP 1: Visit Baby Bonus Online. STEP 2: Click “Join”. It will bring you to a SingPass log-in page. STEP 3: Log in using your SingPass. STEP 4: Complete the relevant sections in the application form. STEP 5: Click “Submit” when done. When applying, please note that both parents have to decide which parent or a third party willreceive the cash gifts as a Nominated Bank Account Holder, andmanage the Child Development Account (CDA) as a CDA trustee.You may wish to know that the Nominated Bank Account Holder for the cash gift and the CDA trustee can be the same person or different persons. The CDA trustee has to be above the age of 18 and must not be a bankrupt. "},
{"predicted_answer":"You can view the transactions made in your Child Development Account or CDA in the monthly statement sent by your CDA bank, or through Internet Banking.You may also go to 'View Statement Summary' on the Baby Bonus Online, log in using your SingPass, and select 'View Statement ' to view the CDA payment details and “Remaining Cap Amount”.For a quick guide on the opening of a CDA and your child’s benefits, you can check out this video under #BiteSizedBabyBonus in Baby Bonus Parenting Resources Facebook Page. "},
{"predicted_answer":"Your spouse will need to visit www.singpass.gov.sg to register for a SingPass account. If your spouse is unable to obtain a SingPass account, you can register your child’s birth at the hospital where he or she was born or at the Immigration & Checkpoints Authority (ICA)."},
{"predicted_answer":"You will be redirected to the Birth Certificate collection page in the app, where you will be able to access the payment process again. If you encounter further issues with payment, please contact us at mol_families@psd.gov.sg."},
{"predicted_answer":"Organisations who wish to withdraw their Approved Institution (AI) status should submit their request using the \"Withdraw AI Status\" service on our Approved Institution Portal. "},
{"predicted_answer":"Children of unwed parents can enjoy Child Development Account (CDA) benefits if they were born on, or after 1 September 2016. They will receive the CDA First Step Grant when they join the Baby Bonus Scheme and open a CDA.They will also receive Government matching contributions for each dollar saved into the CDA, up to the maximum amount shown in the table below:Birth OrderCDA BenefitsCDA First StepDollar-for-Dollar matching1st & 2nd Child$3,000Up to $3,0003rd & 4th ChildUp to $9,0005th Child and higherUp to $15,000 "},
{"predicted_answer":"Currently, you can only key in a local mobile phone number during Birth Registration. You may consider registering your child’s birth at the hospital where he or she was born or at the Immigration & Checkpoints Authority (ICA) instead."},
{"predicted_answer":"For enquiries and feedback on AI, you may write to us using this form. Simply enter ‘Baby Bonus Approved Institution’ in the Subject field. Alternatively, you may call the Baby Bonus hotline at 1800 253 7707 or (+65) 6253 7707 if you are overseas.For enquiries on Banks' Child Development Account (CDA) Products & Baby Bonus Cards, please contact: DBS Bank at 1800 339 6666or visit their website at http://www.dbs.com.sg/ OCBC Bank at 1800 438 6088or visit their website at www.ocbc.com/babybonus UOB at 1800 222 2121or visit their website at http://www.uob.com.sg/ Baby Bonus NETS ServiceSales & Customer Service Centre at 6274 1212or visit their website at http://www.nets.com.sg/"}
]